---
kind: type
id: T:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure
source: html/a47d9f99-df86-e25b-d24f-635362d065b6.htm
---
# Autodesk.Revit.DB.Architecture.NonContinuousRailStructure

A class that represents a collection of Non-Continuous Rails being a part of Railing Type.

## Syntax (C#)
```csharp
public class NonContinuousRailStructure : IDisposable
```